brew "bash"
brew "wget"
brew "jq"
brew "htop"
brew "coreutils"
brew "grep"
brew "gnu-sed"
brew "gnu-tar"
brew "yq"

brew "awscli"
brew "kubectl"
brew "kubectx"
brew "kustomize"
brew "k9s"
brew "k6"
brew "k3d"
brew "opentofu"
brew "terraform"
brew "terragrunt"
brew "cdktf"
brew "ansible"
brew "cmctl"
brew "helm"
brew "kind"
brew "opencode"
brew "ollama"
brew "kubeseal"
brew "istioctl"
brew "gh"
brew "tflint"
brew "spectral-cli"
brew "ncdu"
brew "prism-cli"
brew "tmux"

tap "oven-sh/bun"
brew "bun"

cask "claude-code"
cask "dbeaver-community"
cask "firefox"
cask "google-chrome"
cask "insomnia"
cask "keepassxc"
cask "spotify"
cask "unnaturalscrollwheels"
cask "maccy"
cask "betterdisplay"
cask "cursor"
cask "session-manager-plugin"

cask "visual-studio-code"
cask "jetbrains-toolbox"

brew "go"
brew "mage"

brew "rust"

brew "python3"
brew "pipx"

cask "temurin@11"
cask "temurin@17"
cask "temurin@21"
brew "maven"
brew "gradle"

brew "node@18"
brew "node@20"
