brew "wget"
brew "jq"
brew "htop"

brew "awscli"
brew "kubectl"
brew "kubectx"
brew "kustomize"
brew "k9s"
brew "k6"
brew "opentofu"
brew "terraform"
brew "ansible"

cask "dbeaver-community"
cask "firefox"
cask "google-chrome"
cask "insomnia"
cask "keepassxc"
cask "spotify"
cask "unnaturalscrollwheels"
cask "rectangle"
cask "maccy"
cask "betterdisplay"

cask "visual-studio-code"
cask "jetbrains-toolbox"

brew "go"
brew "mage"

brew "rust"

brew "python3"
brew "pipx"

tap "homebrew/cask-versions"
cask "temurin11"
cask "temurin17"
cask "temurin21"
brew "maven"
brew "gradle"

brew "node@18"
brew "node@20"
